app/views/plantings/_form.html.erb

    <%= form.label :plant_id, "Plant" %><br>
    <%= form.collection_select :plant_id, Plant.all, :id, :name, prompt: "Select a plant" %>
---
SELECT "plants".* FROM "plants" ORDER BY "plants"."name" ASC

    <%= form.label :garden_id, "Garden" %><br>
    <%= form.collection_select :garden_id, Garden.all, :id, :name, prompt: "Select a garden" %>
---
SELECT "gardens".* FROM "gardens"