app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def current_user
    @current_user ||= User.find_by(id: session[:user_id])