app/controllers/gardens_controller.rb

  def create
    @garden = current_user.gardens.new(garden_params)
    if @garden.save
---
INSERT INTO "gardens" ("name", "location", "notes", "user_id", "created_at", "updated_at") VALUES ('Side Garden', 'West side of house', 'AGAINNNN! Testing the update functionality for my test garden', 1, '2025-06-17 15:45:29.647168', '2025-06-17 15:45:29.647168') RETURNING "id"

  def update
    if @garden.update(garden_params)
---
UPDATE "gardens" SET "notes" = 'Testing the update functionality for my test garden, and also making sure that the read more functionality works. Beyond 50 characters, the read more link should show up, and when clicked, everything including the card should expand. Fingers crossed that it works.', "updated_at" = '2025-06-17 15:42:53.893032' WHERE "gardens"."id" = 1

  def set_garden
    @garden = current_user.gardens.find(params[:id])
---
SELECT "gardens".* FROM "gardens" WHERE "gardens"."user_id" = 1 AND "gardens"."id" = 1 LIMIT 1