app/controllers/journal_entries_controller.rb

  def index
  entries = current_user.journal_entries.order(created_at: :desc)

  # Group entries by the first day of the month (as a DATE, not Time)
  grouped_entries = entries.group_by { |e| e.created_at.to_date.beginning_of_month }

  # Establish range of months (as DATEs) to display
  earliest_date = entries.minimum(:created_at)&.to_date&.beginning_of_month || Time.current.to_date.beginning_of_month
---
SELECT MIN("journal_entries"."created_at") FROM "journal_entries" WHERE "journal_entries"."user_id" = 1
SELECT "journal_entries".* FROM "journal_entries" WHERE "journal_entries"."user_id" = 1 ORDER BY "journal_entries"."created_at" DESC

  def set_journal_entry
    @journal_entry = current_user.journal_entries.find(params[:id])
---
SELECT "journal_entries".* FROM "journal_entries" WHERE "journal_entries"."user_id" = 1 AND "journal_entries"."id" = 24 LIMIT 1