app/controllers/plantings_controller.rb

  def set_planting
    @planting = Planting.find(params[:id])
---
SELECT "plantings".* FROM "plantings" WHERE "plantings"."id" = 1 LIMIT 1