app/controllers/plantings_controller.rb

SELECT "plantings".* FROM "plantings" WHERE "plantings"."garden_id" = 1
SELECT "plants".* FROM "plants" WHERE "plants"."id" IN (1, 2, 3)
---
  def index
    @plantings = @garden.plantings.includes(:plant)

SELECT "plants".* FROM "plants"
---
  def new
    @planting = @garden.plantings.build
    @plants = current_user.plants
    @selected_plant_id = params[:selected_plant_id]
    @planting.plant_id = @selected_plant_id if @selected_plant_id.present?

INSERT INTO "plantings" ("plant_id", "garden_id", "date_planted", "notes", "season", "created_at", "updated_at", "location", "user_id") VALUES (2, 2, '2025-06-17', 'Need support. Heavy feeders that need lots of fertilizer', NULL, '2025-06-17 15:57:25.395923', '2025-06-17 15:57:25.395923', NULL, 1) RETURNING "id"
SELECT "plants".* FROM "plants" ORDER BY "plants"."name" ASC
---
  def create
    @planting = @garden.plantings.new(planting_params)
    @planting.user = current_user

    if @planting.save
      redirect_to garden_plantings_path(@garden), notice: "Planting created successfully!"
    else
      @plants = current_user.plants.order(:name)

UPDATE "plantings" SET "notes" = 'Hoping this works this time. Is it working?', "season" = '', "updated_at" = '2025-06-17 18:12:08.279299' WHERE "plantings"."id" = 13
---
  def update
    Rails.logger.debug "🛠️ Attempting to update planting: #{planting_params.inspect}"
    if @planting.update(planting_params)

DELETE FROM "plantings" WHERE "plantings"."id" = 13
---
  def destroy
    @garden = @planting.garden
    @planting.destroy

SELECT "plantings".* FROM "plantings" INNER JOIN "gardens" ON "plantings"."garden_id" = "gardens"."id" WHERE "gardens"."user_id" = 1 AND "plantings"."id" = 13 LIMIT 1
SELECT "plants".* FROM "plants" WHERE "plants"."id" = 4 LIMIT 1
---
  def set_planting
    @planting = current_user.plantings.find(params[:id])

SELECT "gardens".* FROM "gardens" WHERE "gardens"."id" = 2 LIMIT 1
---
  def set_garden
    @garden = Garden.find(params[:garden_id])