app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at", "name", "password_digest") VALUES ('Sally', 'Giraffe', 'sally.giraffe@example.com', '2025-06-03 01:02:27.688860', '2025-06-03 01:02:27.688860', NULL, '$2a$12$Vla2GnDPLkqSKz/p6oTouO/eRXJdOGN1YpNQWarWmXAgi3qEA.nc2') RETURNING "id"